Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: The typical symptom is the appearance of a message on the monitor console that indicates error when esp32 calls the `esp_msync` function.
it_it: Il sintomo tipico è la comparsa di un messaggio sulla console del monitor che indica un errore quando esp32 richiama la funzione `esp_msync`.

source: The underlying driver will automatically determine if the command buffer has been filled.
it_it: Il driver sottostante determinerà automaticamente se il buffer di comando è stato riempito.

source: The unit ``px`` can be omitted.
it_it: L'unità ``px`` può essere omessa.

source: The unpacked source code resides in the db-5.1.19 folder.
it_it: Il codice sorgente decompresso si trova nella cartella db-5.1.19.

source: The update mode can be changed with :cpp:expr:`lv_chart_set_update_mode(chart, LV_CHART_UPDATE_MODE_...)`.
it_it: La modalità di aggiornamento può essere modificata con :cpp:expr:`lv_chart_set_update_mode(chart, LV_CHART_UPDATE_MODE_...)`.

source: The usage is straightforward: the specified ``subject`` will be set to the given ``value`` when the ``trigger`` occurs.
it_it: L'utilizzo è semplice: il ``subject`` specificato verrà impostato sul ``value`` specificato quando si verifica il ``trigger``.

source: The use of sexualized language or imagery and unwelcome sexual
it_it: L'uso di linguaggio o immagini a sfondo sessuale e attenzioni o

source: The user base is growing larger.
it_it: La base utenti è in continua crescita.

source: The user can also call these ``..._create()`` functions at any time from application code to create new Components on demand.
it_it: L'utente può anche richiamare queste funzioni ``..._create()`` in qualsiasi momento dal codice dell'applicazione per creare nuovi Componenti su richiesta.

source: The user can assign callback functions to a widget to process events.
it_it: L'utente può assegnare funzioni di callback a un widget per elaborare gli eventi.

source: The user can then request the gesture values with the following functions:
it_it: L'utente può quindi richiedere i valori del gesto con le seguenti funzioni:

source: The user can use these functions to gather more information about the gesture:
it_it: L'utente può utilizzare queste funzioni per raccogliere maggiori informazioni sul gesto:

source: The user is required to implement the GPIO and SPI IO functionality.
it_it: L'utente deve implementare le funzionalità GPIO e SPI IO.

source: The user needs to create the :ref:`Permanent Screens <xml_screen_permanent>` and any other required Screens to get started.
it_it: L'utente deve creare gli :ref:`Screen Permanenti <xml_screen_permanent>` e qualsiasi altro Screen richiesto per iniziare.

source: The user needs to implement only two platform-specific functions to send a command or pixel data to the controller via SPI or parallel bus.
it_it: L'utente deve implementare solo due funzioni specifiche della piattaforma per inviare un comando o dati pixel al controller tramite SPI o bus parallelo.

source: The value 256 (or `LV_SCALE_NONE`) means normal size, 128 half size, 512 double size, and so on
it_it: Il valore 256 (o `LV_SCALE_NONE`) indica dimensioni normali, 128 dimensioni dimezzate, 512 dimensioni doppie e così via.

source: The value can be in pixels to make the area larger/smaller
it_it: Il valore può essere in pixel per ingrandire/ridurre l'area.

source: The value can be increased or decreased by *Keys* or API functions.
it_it: Il valore può essere aumentato o diminuito tramite *Tasti* o funzioni API.

source: The value is interpreted in 0.1 degree units.
it_it: Il valore viene interpretato in unità di 0,1 gradi.

source: The value is interpreted in a range (minimum and maximum values) which can be modified with :cpp:expr:`lv_arc_set_range(arc, min, max)`.
it_it: Il valore viene interpretato in un "range" (valori minimo e massimo) che può essere modificato con :cpp:expr:`lv_arc_set_range(arc, min, max)`.

source: The value is interpreted in a range (minimum and maximum values) which can be modified with :cpp:expr:`lv_bar_set_range(bar, min, max)`.
it_it: Il valore viene interpretato in un intervallo (valori minimo e massimo) che può essere modificato con :cpp:expr:`lv_bar_set_range(bar, min, max)`.

source: The value is interpreted in pixels (>= 0) or `LV_RADIUS_CIRCLE` for max.
it_it: Il valore viene interpretato in pixel (>= 0) o `LV_RADIUS_CIRCLE` per il massimo del

source: The value must be adjusted based on the number and complexity of UI components.
it_it: Il valore deve essere regolato in base al numero e alla complessità dei componenti dell'interfaccia utente.

source: The value of the points will be scaled proportionally.
it_it: Il valore dei punti verrà scalato proporzionalmente.

source: The value of the widget will be incremented by that amount or the widget will be scrolled by that many pixels.
it_it: Il valore del widget verrà incrementato di tale importo o il widget verrà fatto scorrere di quel numero di pixel.

source: The value should be >= 0.
it_it: Il valore deve essere >= 0.

source: The values are incorrect after some time has passed.
it_it: I valori sono errati dopo un certo periodo di tempo.

source: The values in your array must remain available through the life of that data series.
it_it: I valori nell'array devono rimanere disponibili per tutta la durata di vita di quella serie di dati.

source: The variable refers to a package name in the context of a file created or produced by the OpenEmbedded build system.
it_it: La variabile si riferisce a un nome di pacchetto nel contesto di un file creato o prodotto dal sistema di build di OpenEmbedded.

source: The version is normally extracted from the recipe filename.
it_it: La versione viene normalmente estratta dal nome del file della ricetta.

source: The version of the recipe.
it_it: La versione della ricetta.

source: The visibility time can be adjusted with :c:macro:`LV_TEXTAREA_DEF_PWD_SHOW_TIME` in ``lv_conf.h``.
it_it: Il tempo di visibilità può essere regolato con :c:macro:`LV_TEXTAREA_DEF_PWD_SHOW_TIME` in ``lv_conf.h``.

source: The way the touch points are collected varies based on the hardware and drivers used.
it_it: Il modo in cui vengono raccolti i punti di contatto varia in base all'hardware e ai driver utilizzati.

source: The wayland driver is currently under construction, bug reports, contributions and feedback are always welcome.
it_it: Il driver Wayland è attualmente in fase di sviluppo, segnalazioni di bug, contributi e feedback sono sempre benvenuti.

source: The wayland driver requires some dependencies.
it_it: Il driver Wayland richiede alcune dipendenze.

source: The wayland protocols are defined using XML files which are present in ``/usr/share/wayland-protocols``
it_it: I protocolli wayland sono definiti utilizzando file XML presenti in ``/usr/share/wayland-protocols``

source: The whole PNG image is decoded, so
it_it: L'intera immagine PNG viene decodificata, quindi

source: The whole mechanism (click and select the text as you drag your finger/mouse) is implemented in :ref:`lv_textarea` and the Label Widget only allows programmatic text selection with :cpp:expr:`lv_label_get_text_selection_start(label, start_char_index)` and :cpp:expr:`lv_label_get_text_selection_end(label, end_char_index)`.
it_it: L'intero meccanismo (cliccare e selezionare il testo mentre si trascina il dito/mouse) è implementato in :ref:`lv_textarea` e il Widget Label consente solo la selezione programmatica del testo con :cpp:expr:`lv_label_get_text_selection_start(label, start_char_index)` e :cpp:expr:`lv_label_get_text_selection_end(label, end_char_index)`.

source: The widget supports various configurations, including text alignment, direction, radius adjustment, and color customization.
it_it: Il Widget supporta diverse configurazioni, tra cui l'allineamento del testo, la direzione, la regolazione del raggio e la personalizzazione del colore.

source: The widget types have special attributes as well.
it_it: Anche i tipi di widget hanno attributi speciali.

source: The width must be in the range [1..15] with the default being 1.
it_it: La larghezza deve essere compresa tra [1 e 15], con il valore di default pari a 1.

source: The width of the border.
it_it: Spessore del bordo.

source: The workspace is structured to utilize Buildroot without any modifications.
it_it: L'area di lavoro è strutturata per utilizzare Buildroot senza alcuna modifica.

source: The zero angle is on the right-hand side, and 90 degrees is at the bottom.
it_it: L'angolo zero si trova sul lato destro e quello di 90 gradi in basso.

source: Their chips are designed to excel at multiple aspects at once.
it_it: I loro chip sono progettati per eccellere sotto diversi aspetti contemporaneamente.

source: Their coordinates can either be specified as raw pixel coordinates (e.g. ``{5, 10}``), or as a percentage of the Line's bounding box using :cpp:expr:`lv_pct(x)`.
it_it: Le loro coordinate possono essere specificate come coordinate pixel grezze (ad esempio ``{5, 10}``) o come percentuale del "bounding box" [riquadro di delimitazione] della linea utilizzando :cpp:expr:`lv_pct(x)`.

source: Their default ranges are [0..100].
it_it: I loro intervalli predefiniti sono [0..100].

source: Their default value (if defined)
it_it: Il loro valore di default (se definito)

source: Their default values are 80 and 255.
it_it: I loro valori di default sono 80 e 255.

source: Theme initialization functions can have different prototypes.
it_it: Le funzioni di inizializzazione del tema possono avere prototipi diversi.

source: Themes
it_it: Temi

source: Then PikaScript's pre-compiler can automatically bind the following C functions, simply by naming the functions in the module_class_method format, without any additional work, and all binding and registration is done automatically.
it_it: Il precompilatore di PikaScript può poi associare automaticamente le seguenti funzioni C, semplicemente nominando le funzioni nel formato modulo_classe_metodo, senza alcun lavoro aggiuntivo, e tutto il binding e la registrazione vengono eseguiti automaticamente.

source: Then button1 (along with its child Widget(s)) will be in the background and can be covered by button2 and its children.
it_it: Quindi button1 (insieme ai suoi Widget figli) sarà sullo sfondo e potrà essere coperto da button2 e dai suoi figli.

source: Then execute the downloaded installer to install |lvglpro| Editor.
it_it: Quindi si esegue il programma di installazione scaricato per installare |lvglpro| Editor.

source: Then in both cases, path strings passed to ``lv_fs_...()`` functions in the application get reduced to:
it_it: In entrambi i casi, le stringhe del path passate alle funzioni ``lv_fs_...()`` nell'applicazione vengono ridotte a:

source: Then link this to the LVGL display with ``lv_indev_set_display``.
it_it: Quindi collegarlo al display LVGL con ``lv_indev_set_display``.

source: Then select ``Set an upper cased letter on which the drive will accessible`` and set it to ``65`` (ASCII **A**)
it_it: Poi selezionare ``Set an upper cased letter on which the drive will accessible`` e impostarla su ``65`` (ASCII **A**)

source: Then set the translated image as the image source with :cpp:expr:`lv_image_set_src(img, "S:folder1/my_img.bin")`.
it_it: Quindi impostare l'immagine tradotta come sorgente dell'immagine con :cpp:expr:`lv_image_set_src(img, "S:folder1/my_img.bin")`.

source: Then use :cpp:func:`lv_qrcode_update` to generate the QR Code on it.
it_it: Quindi utilizzare :cpp:func:`lv_qrcode_update` per generare il codice QR.

source: Then, any of those substitutions can be used in that .rst file.
it_it: Poi, , qualsiasi di queste sostituzioni può essere utilizzata nel file .rst.

source: Then, use ``nmap`` or any tool to scan the network and find the IP address of the RPi4.
it_it: Poi, si usa ``nmap`` o qualsiasi altro strumento per scansionare la rete e trovare l'indirizzo IP del RPi4.

source: Then, use the command palette to run "LVGL: Create from Renesas Project".
it_it: Quindi, si utilizza la palette dei comandi per eseguire "LVGL: Create from Renesas Project".

source: Then, write a dictionary in the following format.
it_it: Quindi, scrivere un dizionario nel seguente formato.

source: Then, write your own dictionary according to the following format:
it_it: Poi, si scrive il proprio dizionario secondo il seguente formato:

source: Theory
it_it: Teoria

source: There are 3 options to do this:
it_it: Ci sono 3 opzioni per farlo:

source: There are a few options for defining a callback in LVGL C API:
it_it: Esistono alcune opzioni per definire una callback nell'API C LVGL:

source: There are a lot of ways to contribute to LVGL even if you are new to the library or even new to programming.
it_it: Ci sono molti modi per contribuire a LVGL, anche se si è nuovi della libreria o anche solo un neofita della programmazione.

source: There are a number of built-in *Paths* that can be used:
it_it: Sono disponibili diversi *Path* predefiniti:

source: There are also `many XML parser examples here <https://github.com/lvgl/lvgl/tree/master/src/others/xml/parsers>`__ for the built-in LVGL Widgets.
it_it: Sono disponibili anche `molti esempi di parser XML qui <https://github.com/lvgl/lvgl/tree/master/src/others/xml/parsers>`__ per i Widget LVGL nativi.

source: There are also a number of Widgets that use Image Widgets internally for optional icons:
it_it: Esistono anche diversi Widget che utilizzano internamente Widget immagine per icone opzionali:

source: There are different ways of installing it depending on your platform.
it_it: Esistono diversi modi per installarlo a seconda della piattaforma.

source: There are existing ready to use repositories available.
it_it: Sono disponibili repository pronti all'uso.

source: There are few G2D assertions that can stop the program execution in case the :c:macro:`LV_ASSERT_HANDLER` is set to `while(1);` (Halt by default).
it_it: Esistono alcune asserzioni G2D che possono interrompere l'esecuzione del programma nel caso in cui :c:macro:`LV_ASSERT_HANDLER` sia impostato su `while(1);` ("Halt" per default).

source: There are few PXP assertions that can stop the program execution in case the :c:macro:`LV_ASSERT_HANDLER` is set to `while(1);` (Halt by default).
it_it: Esistono alcune asserzioni PXP che possono interrompere l'esecuzione del programma nel caso in cui esistono alcune asserzioni PXP che possono interrompere l'esecuzione del programma nel caso in cui :c:macro:`LV_ASSERT_HANDLER` sia impostato su `while(1);` ("Halt" per default).

source: There are many boards in the `NuttX mainline <https://github.com/apache/incubator-nuttx>`__ with support for LVGL.
it_it: Ci sono molte board nella `NuttX mainline <https://github.com/apache/incubator-nuttx>`__ con supporto per LVGL.

source: There are many layers working in the Yocto Project development environment.
it_it: Nell'ambiente di sviluppo Yocto Project sono presenti molti layer.

source: There are many terms used that are specific to Yocto and Bitbake environment.
it_it: Sono molti i termini utilizzati, specifici per Yocto e per l'ambiente Bitbake.

source: There are many ways to develop for STM32 including manual bare metal, Zephyr RTOS, NuttX RTOS, ChibiOS, and many more.
it_it: Esistono molti modi per sviluppare per STM32, tra cui bare metal manuale, Zephyr RTOS, NuttX RTOS, ChibiOS e molti altri.

source: There are multiple ways to view LVGL UIs in a browser or even develop UIs directly in a browser environment:
it_it: Esistono diversi modi per visualizzare le interfacce utente LVGL in un browser o persino svilupparle direttamente in un ambiente browser:

source: There are no limitations on the supported IDEs.
it_it: Non ci sono limitazioni sugli IDE supportati.

source: There are no new features compared to :ref:`Base Widget <base_widget>`.
it_it: Non ci sono nuove funzionalità rispetto al :ref:`Base Widget <base_widget>`.

source: There are no prerequisites.
it_it: Non ci sono prerequisiti.

source: There are no special parts on the Tab View but the :ref:`base_widget` and :ref:`lv_button` Widgets are used to create the Tab View.
it_it: Non ci sono parti specifiche nella "Tab View", ma i Widget :ref:`base_widget` e :ref:`lv_button` vengono utilizzati per creare la "Tab View".

source: There are other ways to compile for Alif boards such as with Zephyr RTOS.
it_it: Esistono altri modi per compilare per le schede Alif, ad esempio con Zephyr RTOS.

source: There are predefined includes for EDK2 and GNU-EFI:
it_it: Sono disponibili "include" predefinite per EDK2 e GNU-EFI:

source: There are several built-in fonts in different sizes, which can be enabled in ``lv_conf.h`` with *LV_FONT_...* defines.
it_it: Sono disponibili diversi font integrati in diverse dimensioni, che possono essere abilitati in ``lv_conf.h`` con le definizioni *LV_FONT_...*.

source: There are several cases in which you may not want to perform an action immediately.
it_it: Ci sono diversi casi in cui si potrebbe non voler eseguire un'azione immediatamente.

source: There are several good ways ways to gain deeper knowledge of LVGL.
it_it: Esistono diversi ottimi modi per approfondire la conoscenza di LVGL.

source: There are several options to mask parts of a layer, Widget, or drawing:
it_it: Esistono diverse opzioni per mascherare parti di un layer, Widget o disegno:

source: There are several ways to add a new font to your project:
it_it: Esistono diversi modi per aggiungere un nuovo font al progetto:

source: There are several ways to define events for user interactions.
it_it: Esistono diversi modi per definire gli eventi per le interazioni utente.

source: There are several ways to do this.
it_it: Esistono diversi modi per farlo.

source: There are several ways to perform this task.
it_it: Esistono diversi modi per eseguire questa operazione.

source: There are some additional XML loading functions available when using :ref:`frogfs`.
it_it: Sono disponibili alcune funzioni aggiuntive di caricamento XML quando si utilizza :ref:`frogfs`.

source: There are some different use cases for LVGL's driver.
it_it: Esistono diversi casi d'uso per il driver LVGL.

source: There are some flags that can be used on Widgets to affect how they behave with layouts:
it_it: Esistono alcuni flag che possono essere utilizzati sui Widget per influenzarne il comportamento con i layout:

source: There are some key folders:
it_it: Ci sono alcune cartelle chiave:

source: There are some predefined keys which have special meaning:
it_it: Ci sono alcuni tasti predefiniti che hanno un significato speciale:

source: There are some special rules to display Arabic and Persian characters: the *form* of a character depends on its position in the text.
it_it: Esistono alcune regole speciali per visualizzare i caratteri arabi e persiani: la *forma* di un carattere dipende dalla sua posizione nel testo.

source: There are structures in LVGL that are considered to be private and that is what these describe.
it_it: In LVGL ci sono strutture considerate private, ed è proprio ciò che descrivono.

source: There are three explicit ways to change a Widget's layer position (Z-order) among Widgets that share the same parent:
it_it: Esistono tre modi espliciti per modificare la posizione del layer (ordine Z) di un Widget tra quelli che condividono lo stesso elemento padre:

source: There are two main influencing factors: the size of the font file and the size of the dictionary.
it_it: Ci sono due fattori principali che influenzano l'esecuzione: la dimensione del file del font e la dimensione del dizionario.

source: There are two ways to provide this information to LVGL:
it_it: Esistono due modi per fornire queste informazioni a LVGL:

source: There are two ways to use FreeType:
it_it: Esistono due modi per utilizzare FreeType:

source: There are two ways to use LVGL in your QNX project.
it_it: Esistono due modi per utilizzare LVGL nei progetti QNX.

source: There could be case where it was needed to load an image file into dynamically-allocated RAM at run-time and free it later, thus avoiding storing the images as part of the application.
it_it: Potrebbe verificarsi il caso in cui fosse necessario caricare un file immagine nella RAM allocata dinamicamente in fase di esecuzione e liberarla in un secondo momento, evitando così di memorizzare le immagini come parte dell'applicazione.

source: There is a build available for RPi4 62 bits: ``raspberrypi4_64_defconfig``.
it_it: È disponibile una build per RPi4 a 62 bit: ``raspberrypi4_64_defconfig``.

source: There is a common **delete** function for all widget types.
it_it: Esiste una funzione **delete** comune per tutti i tipi di widget.

source: There is a guide detailing how to `port a board <https://docs.zephyrproject.org/latest/hardware/porting/board_porting.html>`_ and the valid properties in the devicetree for `input <https://docs.zephyrproject.org/latest/build/dts/api/bindings/input/zephyr%2Clvgl-pointer-input.html>`_.
it_it: È disponibile una guida che descrive in dettaglio come effettuare il `porting di una board <https://docs.zephyrproject.org/latest/hardware/porting/board_porting.html>`_ e le proprietà valide nel devicetree per l'`input <https://docs.zephyrproject.org/latest/build/dts/api/bindings/input/zephyr%2Clvgl-pointer-input.html>`_.

source: There is a recipe in ``meta-openembedded`` since ``honister``.
it_it: C'è una ricetta in ``meta-openembedded`` fin dalla versione ``honister``.

source: There is a renderer in LVGL which caches software-rendered areas as OpenGL textures.
it_it: In LVGL è presente un renderer che memorizza nella cache le aree renderizzate tramite software come texture OpenGL.

source: There is a temporary RAM cost to doing this.
it_it: Questa operazione comporta un consumo temporaneo di RAM.

source: There is also an option to choose a "Build Type".
it_it: È anche possibile scegliere un "Build Type".

source: There is also support for installing Windows 11 on it.
it_it: È anche supportato l'installazione di Windows 11.

source: There is an ``outline_pad`` property to specify the gap between the target area and the inner side of the outline.
it_it: Esiste una proprietà ``outline_pad`` per specificare lo spazio tra l'area target e il lato interno del contorno.

source: There is an example of this among the :ref:`Style examples <style_examples>`.
it_it: Un esempio di questo è presente tra gli :ref:`esempi di Stile <style_examples>`.

source: There is limited information that can be collected about macros and in most cases a binding will need to have these statically added to a binding.
it_it: Le informazioni che si possono raccogliere sulle macro sono limitate e nella maggior parte dei casi un binding richiederà che queste vengano aggiunte staticamente a un binding.

source: There is no ``border_side`` property for the outline.
it_it: Non esiste una proprietà ``border_side`` per il contorno.

source: There is no need to implement any platform-specific functions.
it_it: Non è necessario implementare funzioni specifiche per la piattaforma.

source: There is no support for input/uinput keyboards yet.
it_it: Non è ancora disponibile il supporto per le tastiere input/uinput.

source: There is only one function that is the same for every layout: :cpp:func:`lv_obj_set_layout` ``(widget, <LAYOUT_NAME>)`` sets the layout on a Widget.
it_it: C'è una sola funzione che è la stessa per ogni layout: :cpp:func:`lv_obj_set_layout` ``(widget, <LAYOUT_NAME>)`` imposta il layout su un Widget.

source: There is probably a bug in your display driver.
it_it: Probabilmente c'è un bug nel driver del display.
